# Используем официальный образ Node.js
FROM node:18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src

# Копируем package.json и package-lock.json (если он есть) в контейнер
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь проект в контейнер
COPY . .

# Копируем файл .env в контейнер для использования переменных окружения
# COPY .env .env

# Открываем порты для приложения и MongoDB
EXPOSE 3000
EXPOSE 27017

# Запускаем приложение
CMD ["npm", "start"]
